export const testTitle = {
    title: "标题",
    tags: ["tag1", "tag2", "tag3"],
};

export const testContent =
    `
我们怀揣热忱的灵魂天然被赋予对超越性的追求，不屑于古旧坐标的约束，钟情于在别处的芬芳。但当这种期望流于对过去观念不假思索的批判，乃至走向虚无与达达主义时，便值得警惕了。与秩序的落差、错位向来不能为越矩的行为张本。而纵然我们已有翔实的蓝图，仍不能自持已在浪潮之巅立下了自己的沉锚。

我们怀揣热忱的灵魂天然被赋予对超越性的追求，不屑于古旧坐标的约束，钟情于在别处的芬芳。但当这种期望流于对过去观念不假思索的批判，乃至走向虚无与达达主义时，便值得警惕了。与秩序的落差、错位向来不能为越矩的行为张本。而纵然我们已有翔实的蓝图，仍不能自持已在浪潮之巅立下了自己的沉锚。
`;

export const testImages = [
    {
        id: 1, url: "https://img.daisyui.com/images/stock/photo-1625726411847-8cbb60cc71e6.webp"
    },
    {
        id: 2, url: "https://img.daisyui.com/images/stock/photo-1414694762283-acccc27bca85.webp"
    },
    {
        id: 3, url: "https://img.daisyui.com/images/stock/photo-1665553365602-b2fb8e5d1707.webp"

    },
    {
        id: 4, url: "https://img.daisyui.com/images/stock/photo-1609621838510-5ad474b7d25d.webp",
    }
];

export const testComment = [
    {
        id: 1, content: "人家尼科尔基德曼雪白了一辈子。"
    },
    {
        id: 2, content: "中国人的祖先认为最美的女性皮肤是：洁白无瑕、肤如凝脂、白里透红，唇红齿白等，有上千年的历史了。"
    },
    {
        id: 3, content: "我觉得欧美人追求小麦色肤色，一开始是他们工人运动先闹了一遍，现在主要是掩盖雀斑和因为卖血导致的糟糕脸色。本原生白皮党觉得白人晒稍微有一点红或者有点黄好看，晒小麦色反而不太好看。"
    },
    {
        id: 4, content: "因为自己没有的就是最香的。"
    },
    {
        id: 5, content: "我也觉得小麦色很有性张力"
    },
    {
        id: 6, content: "气候环境原因，欧洲的纬度比较高而且阴天和雾天比较多，日照相比中国要小很多，所以肤色普遍较白，要花钱出去旅游度假才有晒黑的机会。这点和中国的成都类似。而中国大多数地区反着来，在室外工作的容易晒黑，条件比较好的才会白，也就是所谓富贵人家。这就是为什么欧洲以黑为美，亚洲以白为美的原因"
    },
    {
        id: 7, content: "本质都是哪种肤色能体现富有就追哪种。东南亚也追白，欧美追黑是因为有钱人才有大把时间度假晒太阳"
    },
    {
        id: 8, content: "因为中国人的白是白里透红，而西方人的白是死猪肉的白，能不恶心人吗？"
    },
    {
        id: 9, content: "我觉得欧美人追求小麦色肤色，一开始是他们工人运动先闹了一遍，现在主要是掩盖雀斑和因为卖血导致的糟糕脸色。本原生白皮党觉得白人晒稍微有一点红或者有点黄好看，晒小麦色反而不太好看。"
    },
    {
        id: 10, content: "我觉得欧美人追求小麦色肤色，一开始是他们工人运动先闹了一遍，现在主要是掩盖雀斑和因为卖血导致的糟糕脸色。本原生白皮党觉得白人晒稍微有一点红或者有点黄好看，晒小麦色反而不太好看。"
    }
]